{
  "intents": [
    {
      "tag": "cumprimento",
      "patterns": [
        "Olá",
        "Oi",
        "Como você está?",
        "Tem alguém aí?",
        "Bom dia"
      ],
      "responses": [
        "Oi! Como posso ajudar você?",
        "Oi, como posso te ajudar?"
      ]
    },
    {
      "tag": "o que é estoicismo",
      "patterns": [
        "O que é estoicismo?",
        "Gostaria de saber sobre o estoicismo",
        "Pode me explicar o estoicismo?"
      ],
      "responses": [
        "O estoicismo é uma escola filosófica que busca a imperturbabilidade, a extirpação das paixões e a aceitação resignada do destino. Essas são as qualidades fundamentais do homem sábio, que estaria apto a experimentar a verdadeira felicidade."
      ]
    },
    {
      "tag": "why estoicismo",
      "patterns": [
        "Qual é o propósito do estoicismo?",
        "Por que devo me interessar pelo estoicismo?",
        "Por que o estoicismo é relevante?"
      ],
      "responses": [
        "O estoicismo é interessante para qualquer pessoa que busca a verdadeira felicidade. Ele parte do princípio de que o universo é governado por uma lei natural divina e racional. Para alcançar a verdadeira felicidade, devemos depender apenas da nossa virtude, ou seja, nossos conhecimentos e valores, abdicando totalmente do vício."
      ]
    },
    {
      "tag": "when estoicismo",
      "patterns": [
        "Quando surgiu o estoicismo?",
        "Onde e quando o estoicismo teve origem?",
        "Em qual período o estoicismo floresceu?"
      ],
      "responses": [
        "O estoicismo surgiu com Zenão de Citio no início do século III a.C. Essa filosofia foi tão popular que persistiu até 529 d.C., quando o imperador romano Justiniano ordenou o fechamento de todas as escolas de filosofia pagã."
      ]
    },
    {
      "tag": "how estoicismo",
      "patterns": [
        "Como funciona o estoicismo?",
        "Como posso praticar o estoicismo?",
        "Quais são os princípios do estoicismo?"
      ],
      "responses": [
       "O estoicismo é uma filosofia voltada para a eudaimonia, que é a felicidade ou bem-estar alcançado através da arte de viver de acordo com a natureza. Para alcançar a eudaimonia, devemos buscar a virtude pessoal e o autocontrole das emoções. O estoicismo enfatiza a apatheia, que é a ausência de sofrimento, um estado de espírito próprio daqueles que estão livres das perturbações emocionais, como raiva, medo, inveja e ódio."
      ]
    },
    {
      "tag": "who estoicismo",
      "patterns": [
        "Quem foram os filósofos estoicos?",
        "Quais são os principais filósofos do estoicismo?",
        "Quem contribuiu para o estoicismo?"
      ],
      "responses": [
        "Entre os filósofos estoicos mais conhecidos estão Zenão de Citio, Sêneca, Epiteto e Marco Aurélio, que foi imperador romano."
      ]
    },
    {
      "tag": "o que é racionalismo",
      "patterns": [
        "O que é o racionalismo?",
        "Qual é a definição de racionalismo?"
      ],
      "responses": [
        "O racionalismo é uma corrente filosófica que destaca a razão como fonte primária do conhecimento. Isso significa que a razão e a lógica são usadas para compreender o mundo e resolver problemas, ao invés da experiência empírica ou da tradição.",
        "O racionalismo é uma abordagem filosófica que acredita que a razão é a principal fonte de conhecimento, e que é através do raciocínio e da lógica que podemos entender o mundo. Ele se opõe à ideia de que a experiência empírica ou a tradição são as únicas maneiras de se chegar ao conhecimento."
      ]
    }
  ]
}